import 'package:flutter/material.dart';
import 'package:medica/screens/static_pages/testing/cubit/tests_cubit.dart';
import 'package:medica/shared/styles/AppColor.dart';

class Prepare extends StatelessWidget {
  const Prepare({
    super.key,
  });

  @override
  Widget build(BuildContext context) {
    TestsCubit cubit = TestsCubit.get(context);

    return SliverList(
      delegate: SliverChildBuilderDelegate(
        (context, index) {
          return Padding(
            padding: const EdgeInsets.all(8.0),
            child: Container(
              decoration: BoxDecoration(
                borderRadius: BorderRadius.circular(10),
                color: Colors.white,
                boxShadow: [
                  BoxShadow(
                    color: Colors.grey.withOpacity(0.3),
                    spreadRadius: 2,
                    blurRadius: 7,
                    offset: Offset(0, 3), // changes position of shadow
                  ),
                ],
              ),
              child: ListTile(
                title: Text(
                  labels[index],
                  textDirection: TextDirection.rtl,
                ),
                subtitle: cubit.selectedDescriptionIndex == index
                    ? Text(
                        descriptions[index],
                        textDirection: TextDirection.rtl,
                      )
                    : null,
                leading: IconButton(
                  icon: Icon(
                    cubit.selectedDescriptionIndex == index
                        ? Icons.remove
                        : Icons.add,
                    color: cubit.selectedDescriptionIndex == index
                        ? AppColor.dividerColor // Change to your desired color
                        : AppColor.orangcolor,
                  ),
                  onPressed: () {
                    cubit.selectDescription(index);
                  },
                ),
              ),
            ),
          );
        },
        childCount: labels.length,
      ),
    );
  }
}

final List<String> labels = [
  'دهون الدم',
  'سكر صائم',
  'سكر بعد الأكل بساعتين',
  'منحنى السكر',
  'عينة البول للدرن',
  'تجميع بول 24 ساعة',
  'اختبار حمل بالبول',
  'مزرعة البول',
  'مسحة الحلق',
  'عينة البصاق للدرن',
  'تحليل المنى',
  'عينة البصاق',
  'مزرعة البروستاتا',
  'مزرعة البراز',
  'تحليل براز الدم الخفي',
  'أدوية الربو أو أدوية الصرع',
  'تحليل الحديد',
];

final List<String> descriptions = [
  'عند اجراء تحاليل دهون كامله مع سكر صائم يشترط الصيام 10ساعات بالظبط يمتنع فيهم عن الاكل و التدخين و يسمح فقط بالماء و الدواء',
  'يشترط الصيام من 6- 8 ساعات مسموح بشرب المياه والدواء و نمتنع عن الاكل و التدخين عند اجراء تحاليل دهون كامله مع سكر صائم يشترط الصيام 10ساعات بالظبط يمتنع فيهم عن الاكل و التدخين و يسمح فقط بالماء و الدواء',
  'يتم احتساب الساعتين من بداية الأكل يشترط الانتهاء من الأكل في خلال 10 دقائق على الأكثر وإذا كان المريض يأخذ علاج للسكر فيتم أخذ العلاج إلا إذا كان للطبيب المعالج رأي أخر علما بأنه يمكن شرب الماء فقط أثناء الساعتين.',
  'يجب على المريض الحضور صباحا الى المعمل ويكون صائم لمده 12 ساعة الامتناع تماما عن التدخين أثناء اجراء الاختبار يتم اخذ عينه والمريض صائم ثم يتم تناول جرعه الجلوكوز المعده بالمعمل يتم اخذ عينه بعد ساعه و بعد ساعتين ( 3 ساعات للسيدات الحوامل)',
  'يتم تجميع البول الصباحي لمدة 3 أيام متتالية يمكن حفظ العينات فى الثلاجة لحين استكمال العدد وارسالها الى المعمل أو ارسال عينة تلو الاخرى',
  'افراغ المثانة كاملة في دورة المياه مع القيام بتسجيل الوقت في ذلك الحين تجميع أي بول بعد ذلك في زجاجة مناسبة نظيفة و جافة و و كافيه للتجميع و يستمر تجميع البول حتى نفس الوقت المسجل في اليوم التالي يحفظ البول في الثلاجة لحين إرساله إلى المعمل',
  'يفضل اول بول في الصباح ضروره الإقلال من تناول السوائل مساء اليوم السابق للتحليل علما بان اختبار الحمل بالدم أكثر حساسيه منه في البول',
  'غسل اليد و الأعضاء التناسلية بالماء و الصابون تطهير فتحة البول بالماء والصابون و يتم ابعاد الجلد اوالشفرتين عن مجرى البول فى السيدات اثناء جمع العينة يفرغ الجزء الأول من البول في دورة المياه ثم يوضع جزء من البول فى الاناء المعقم الذي يوفره المعمل ثم يفرغ الجزء الاخير فى دورة المياه الامتناع عن تناول المضاد الحيوي لمده 48 ساعه قبل اجراء الاختبار ما لم يكن للطبيب المعالج رأي اخر. و في حاله احضار العينه من المنزل يجب أن تصل للمعمل خلال ساعتين على الأكثر.',
  'يجب ان يكون المريض صائما 8 ساعات ويفضل ايقاف المضاد الحيوى لمدة 48 ساعة وعدم استخدام الغرغرة او أي محلول مطهر للحلق قبل عمل المسحة بحوالي 8 ساعات.',
  'تؤخذ ثلاث عينات في ثلاثة أيام متتالية كما فى طريقة تجميع البصاق العادي يمكن حفظ العينات في الثلاجة لحين استكمال العدد وارسال الثلاث عينات او ارسال عينة تلو الاخرى.',
  'يشترط الإمتناع عن الجماع أو حدوث الاحتلام لمده 3-5 أيام متتالية قبل اجراء التحليل يفضل اعطاء العينه بالمعمل مع ضرورة الاهتمام بوضع كل المنى وخاصة النقط الأولى في الكوب المعد لذلك ضروره مراعاة عدم وجود أي ماء أو صابون . في حاله احضار العينه من المنزل يجب ألا يمر عليها أكثر من 20 دقيقة يتم استلام العينات المنى فى الفرع الرئيسى فقط وتوضع فى الحضانة لحين فحصها',
  'تؤخذ العينة في الصباح فور استيقاظ المريض من النوم وقبل تناول الافطار يقوم المريض بمضمضة فمه بالماء فقط ويضع العينة بالكوب ويغلقه جيدا بسرعة يطهر سطحه الخارجي باستخدام قطنة مبللة بكحول 70% يمكن تسهيل خروج العينة باستنشاق بخار ماء ساخن . ترسل العينة الي المعمل في أسرع وقت ممكن (فى غضون ساعة من الجمع ) وإذا تعذر ذلك توضع فى الثلاجة ( 2-8م) وترسل فى أسرع وقت .',
  'يتم الامتناع عن تناول المضاد الحيوى لمده 48 ساعه قبل اجراء الاختبار يتم الامتناع ايضا عن الجماع لمده 3-5 ايام قبل اجراء الاختبار ويتم حبس البول لمده ساعه قبل اجراء الاختبار',
  'ايقاف المضادات الحيوية لمدة 48 ساعة تجميع العينة فى وعاء نظيف وجاف ترسل العينة إلى المعمل فى خلال ساعة ولا يتم قبول العينات فى الحفاضات ولا مخلوطة بالماء أو الصابون أو البول أو المناديل الورقية',
  'يمتنع المريض لمده 48 ساعة عن تناول جميع انواع اللحوم الحمراء و الكبده و الفجل و أدوية الروماتيزم و أي أدوية تحتوى على الأسبرين أو فيتامين ج أوالكورتيزون أو الحديد لا يسمح بأخذ ملينات',
  'يؤخذ الدواء لمده 5 ايام على الاقل بانتظام قبل التحليل يشترط عدم وجود قىء أو اسهال لمده 48 ساعه قبل اجراء الاختبار تؤخذ عينة دم خلال ساعة قبل موعد الجرعة لقياس أقل نسبة للدواء بالدم تؤخذعينة أخرى بعد الجرعة بعدة ساعات ( تختلف من دواء الى أخر ) لقياس اعلى نسبه للدواء بالدم .',
  'صيام 6 - 8 ساعات. يتم سحب عينة الدم صباحاً بعد انتهاء الدورة الشهرية (للسيدات) ويفضل قبل بداية علاج الحديد'
];
